require_relative 'models'

tt = BookList.new([
    Book.new('Толстой', 'Преступление и наказание', '2020-06-17'),
    Book.new('Данте', 'Божественная комедия', '2020-05-18'),
    Book.new('Ницше', 'Заратустра', '2020-04-20'),
    Book.new('Толстой', 'Пр', '2018-06-17'),
    Book.new('Данте', 'Боже', '2017-05-18'),
    Book.new('Ницше', 'Зара', '2015-04-20'),
    Book.new('Толстой', 'Преступление и наказание', '2020-06-17'),
    Book.new('Данте', 'Божественная комедия', '2020-05-18'),
    Book.new('Ницше', 'Заратустра', '2020-04-20'),
  ])

pp tt.years